PeleAB/STM32N6-FaceRecognition/Src/main.c
    LL_ATON_RT_DeInit_Network(&NN_Instance_face_recognition);
    return similarity;
}

/**
 * @brief Initialize application context and neural networks
 * @param ctx Application context
 */
/**
 * @brief Initialize application context and subsystems
 * @param ctx Application context pointer
 * @return 0 on success, negative on error
 */
static int app_init(app_context_t *ctx)
{
    int ret = 0;
    
    /* Initialize configuration manager */
    ret = config_manager_init(&ctx->config);
    if (ret < 0) {
        return ret;
    }
    
    /* System initialization */
    App_SystemInit();
    LL_ATON_RT_RuntimeInit();
    
    /* Initialize embeddings bank */
    embeddings_bank_init();
    
    /* Initialize enhanced PC streaming */
    Enhanced_PC_STREAM_Init();
    
    /* Hardware initialization */
    BSP_LED_Init(LED1);
    BSP_LED_Init(LED2);
    BSP_LED_Off(LED1);
    BSP_LED_Off(LED2);
    BSP_PB_Init(BUTTON_USER1, BUTTON_MODE_GPIO);
    
    /* Neural network initialization */
    LL_ATON_DECLARE_NAMED_NN_INSTANCE_AND_INTERFACE(face_detection);
    const LL_Buffer_InfoTypeDef *nn_in_info = LL_ATON_Input_Buffers_Info_face_detection();
    const LL_Buffer_InfoTypeDef *fr_in_info = LL_ATON_Input_Buffers_Info_face_recognition();
    const LL_Buffer_InfoTypeDef *fr_out_info = LL_ATON_Output_Buffers_Info_face_recognition();
    
    ctx->nn_in = (uint8_t *) LL_Buffer_addr_start(&nn_in_info[0]);
    ctx->fr_nn_in = (uint8_t *) LL_Buffer_addr_start(&fr_in_info[0]);
    ctx->fr_nn_out = (float32_t *) LL_Buffer_addr_start(&fr_out_info[0]);
    ctx->fr_in_len = LL_Buffer_len(&fr_in_info[0]);
    ctx->fr_out_len = LL_Buffer_len(&fr_out_info[0]);
    
    /* Post-processing initialization */
    app_postprocess_init(&ctx->pp_params);
    
    return 0;
}

/**
 * @brief Process frame detections - simplified tracker-free approach
 * @param ctx Application context
 * @param boxes Detected bounding boxes
 * @param box_count Number of detected boxes
 */
static void process_frame_detections(app_context_t *ctx, pd_pp_box_t *boxes, uint32_t box_count)
{
    /* Reset frame state */
    ctx->face_detected = false;
    ctx->face_verified = false;
    ctx->current_similarity = 0.0f;
    
    /* Process detections if any found */
    if (box_count > 0) {
        /* Find box with highest confidence */
        uint32_t best_idx = 0;
        for (uint32_t i = 1; i < box_count; i++) {
            if (boxes[i].prob > boxes[best_idx].prob) {
                best_idx = i;
            }
        }
        
        ctx->best_detection = boxes[best_idx];
        ctx->face_detected = true;
        
        /* Run face recognition if confidence is high enough */
        if (ctx->best_detection.prob >= FACE_DETECTION_CONFIDENCE_THRESHOLD) {
            float similarity = verify_box(ctx, &ctx->best_detection);
            ctx->current_similarity = similarity;
            
            /* Update multi-frame decision algorithm */
            update_similarity_history(ctx, similarity);
            compute_stable_verification(ctx);
            
            /* Use smoothed similarity for display and decisions */
            float display_similarity = ctx->history_count >= 3 ? ctx->smoothed_similarity : similarity;
            ctx->best_detection.prob = display_similarity;
            
            /* Face verification based on stable multi-frame decision */
            ctx->face_verified = ctx->stable_verification;
            
            /* Update the box in the output with the smoothed similarity score */
            boxes[best_idx].prob = display_similarity;
        } else {
            /* No face recognition run - reset history for clean state */
            ctx->history_count = 0;
            ctx->history_index = 0;
            ctx->smoothed_similarity = 0.0f;
            ctx->stable_verification = false;
        }
    }
}

/**
 * @brief Update LED status based on stable verification state
 * @param ctx Application context
 */
static void update_led_status(const app_context_t *ctx)
{
    if (ctx->stable_verification) {
        BSP_LED_On(LED2);   /* Green LED - stable face verification */
        BSP_LED_Off(LED1);
    } else if (ctx->face_detected) {
        BSP_LED_On(LED1);   /* Red LED - face detected but not stably verified */
        BSP_LED_Off(LED2);
    } else {
        /* No face detected - turn off both LEDs */
        BSP_LED_Off(LED1);
        BSP_LED_Off(LED2);
    }
}

/**
 * @brief Clean up neural network output buffers
 * @param nn_out Array of neural network output buffers
 * @param nn_out_len Array of buffer lengths
 * @param number_output Number of outputs
 */
static void cleanup_nn_buffers(float32_t **nn_out, int32_t *nn_out_len, int number_output)
{
    for (int i = 0; i < number_output; i++) {
        SCB_InvalidateDCache_by_Addr(nn_out[i], nn_out_len[i]);
    }
}

/**
 * @brief Main application loop
 * @param ctx Application context
 */
/* Removed unused helper functions to fix compilation warnings */

/**
 * @brief Main application loop (refactored)
 * @param ctx Application context
 * @return 0 on success, negative on error
 */
static int app_main_loop(app_context_t *ctx)
{
    LL_ATON_DECLARE_NAMED_NN_INSTANCE_AND_INTERFACE(face_detection);
    const LL_Buffer_InfoTypeDef *nn_out_info = LL_ATON_Output_Buffers_Info_face_detection();
    
    float32_t *nn_out[MAX_NUMBER_OUTPUT];
    int32_t nn_out_len[MAX_NUMBER_OUTPUT];
    int number_output = 0;
    
    /* Count and initialize output buffers */
    while (nn_out_info[number_output].name != NULL && number_output < MAX_NUMBER_OUTPUT) {
        nn_out[number_output] = (float32_t *) LL_Buffer_addr_start(&nn_out_info[number_output]);
        nn_out_len[number_output] = LL_Buffer_len(&nn_out_info[number_output]);
        number_output++;
    }
    
    uint32_t nn_in_len = LL_Buffer_len(&LL_ATON_Input_Buffers_Info_face_detection()[0]);
    uint32_t pitch_nn = 0;
    uint32_t timestamps[3] = { 0 };
    
    app_input_init(&pitch_nn);
    
    while (1) {
        /* Frame capture */
        if (app_get_frame(nn_rgb, pitch_nn) != 0) {
            continue;
        }
        
        /* Prepare input for neural network */
        img_rgb_to_chw_float(nn_rgb, (float32_t *)ctx->nn_in, NN_WIDTH * NN_BPP,
                            NN_WIDTH, NN_HEIGHT);
        SCB_CleanInvalidateDCache_by_Addr(ctx->nn_in, nn_in_len);
        
        /* Run face detection */
        timestamps[0] = HAL_GetTick();
        RunNetworkSync(&NN_Instance_face_detection);
        LL_ATON_RT_DeInit_Network(&NN_Instance_face_detection);
        
        /* Post-processing */
        int32_t ret = app_postprocess_run((void **) nn_out, number_output, &ctx->pp_output, &ctx->pp_params);
        if (ret != 0) {
            continue;
        }
        
